ExampleInput/building2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          4400;
        startFace       1688900;
    }
    outlet
    {
        type            patch;
        nFaces          4400;
        startFace       1693300;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       1697700;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14200;
        startFace       1698200;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14300;
        startFace       1712400;
    }
    side
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10400;
        startFace       1726700;
    }
)

// ************************************************************************* //
