ExampleInput/building2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libturbulentInflow.so"
);

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.001;

deltaT          0.001;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    forces
    {
        // Monitor forces on cylinder

        type                forces;
        libs                ("libforces.so");
        writeControl        writeTime;
        patches             (cylinder);
        rho                 rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }

    surfaceSampling
    {
        // Sample near-wall velocity

        type surfaces;

        // Where to load it from (if not already in solver)
        libs            ("libsampling.so");

        interpolationScheme cellPoint;

        writeControl    writeTime;

        surfaceFormat vtk;

        // Fields to be sampled
        fields
        (
            p
        );

        surfaces
        (
            nearWall
            {
                type            patch;
                patches         (cylinder);
            }
        );
    }
}

// ************************************************************************* //
